{
  "title": "Our Services",
  "description": "Discover Vasari’s integrated services in architecture, construction, interiors, and development.",
  "heroImage": "/uploads/hero2.jpg",
  "body": "At Vasari, we offer a comprehensive suite of services that seamlessly integrate architecture, construction, interior design, project management, and development management. Our holistic approach ensures that every aspect of your project is handled with care, precision, and a deep understanding of your vision.\n\nFrom the initial concept to the final finish, we guide you through each stage of the process, maintaining a consistent focus on quality, detail, and design integrity. Our team collaborates closely with you to create spaces that are not only beautiful but also functional and enduring.\n\nExplore our key services below to learn how we can bring your dream home to life.",
  "services": [
    {
      "title": "Architecture",
      "content": "At Vasari, our architectural service begins with a deep understanding of place — responding to the character of each site or building and the needs of the brief. We guide projects from concept through planning and construction, creating timeless architecture that feels both grounded and elevated.",
      "image": "/uploads/hero1.jpg"
    },
    {
      "title": "Construction Management",
      "content": "Construction is where design becomes reality — and Vasari remains closely involved at every step. We manage the build with precision and care, working with a trusted network of artisans, contractors and consultants who share our values. This close collaboration allows us to maintain control over quality, detail and pace — ensuring the finished home reflects the original vision without compromise.",
      "image": "/uploads/hero2.jpg"
    },
    {
      "title": "Interior Design",
      "content": "Vasari interiors are defined by a sense of ease, depth and quiet elegance. We design with intention, creating spaces that are both deeply personal and beautifully resolved. Grounded in craftsmanship and material integrity, every project reflects the rhythms of real life while embodying a refined and timeless aesthetic. Our work favours emotional connection over visual noise — homes that feel instinctive, enduring and entirely personal.",
      "image": "/uploads/hero3.jpg"
    },
    {
      "title": "Project Management",
      "content": "Vasari provides a central layer of leadership and continuity — bringing together architecture, construction and interior design into a unified process. We oversee the full journey, coordinating teams, managing timelines and guiding key decisions to ensure the original intent is never diluted. By setting the tone, structure and pace of the project, we protect its integrity from concept to completion.",
      "image": "/uploads/hero4.jpg"
    },
    {
      "title": "Development Management",
      "content": "Vasari leads the entire development process — from site acquisition and concept design through to construction, interiors and eventual sale. These projects are created for market and built to embody the full Vasari vision: homes with architectural presence, refined interiors and a sense of ease that resonates with how people truly want to live. Backed by a committed investor base, we identify high-potential opportunities and deliver distinctive, design-led homes that outperform their markets. Every decision is shaped by design integrity, character and long-term value.",
      "image": "/uploads/hero5.jpg"
    }
  ]
}
